class TextData {
  static List<String> tachkile_about = [
    'التشكيل',
    """تشكيل النصوص العربية أهم مسائل معالجة اللغة العربية، بلوغه يقتضي تجاوز عقبات عديدة، وقد أهمّت هذه المسألة الكثير من الباحثين، وحتى الشركات.

وقد ركّزنا عملنا الأول في التدقيق الإملائي مفتوح المصدر حتى فتحت أمامنا آفاق جديدة، استفاد منها كثير من المطورين لاسيما في مجال المصادر المفتوحة، فصرنا نقسّم المشاريع إلى مشاريع صغيرة ذات استعمالات متعددة متكاملة،

مثل قطرب لتصريف الأفعال، والرديف للمترادفات والأضداد وجموع التكسير والقوافي، ومشروع الكلمات المستبعدة stop words، ومشروع نفطويه لتصنيف الكلمات العربية، ومعجم الراموز الوسيط، المدقق النحوي للمكتب المفتوح، وغيرها منالمشاريع.

وقد اعتمدنا في تطوير هذه المشاريع على التحسين المستمر بإطلاق نسخ تجريبية تتبعها نسخ محسنة، والاستفادة من بعضها البعض، فكلما تقدّم مشروع تقدمت مشاريع أخرى.

ويأتي هذا المشروع في طلّ فراغ كبير، ليقدّم مشروعا مفتوح المصدر للتشكيل، بل المتاح الوحيد للمستخدم حاليا على الإنترنت.""",
    'أسئلة شائعة',
    'ما هو مشكال',
    ' مشكال برنامج لتشكيل النصوص العربية آليا لاستعمالها في القراءة والتعليم وفك الغمض عنها',
    'لماذا مشكال مفتوح المصدر',
    ' برنامج مشكال مفتوح المصدر، مما يعطي للمستخدم والمطوّر حريّة استعماله، والهدف منه توفير اللبنات الأساسية لبناء نظم لمعالجة اللغة العربية، وتطبيقات مختلفة لها.',
    'لماذا التشكيل سيء؟',
    ' خوارزميات التشكيل تقريبية، ونتائجها غير دقيقة، وبعض النصوص تتمل أكثر من حالة، وتحتاج إلى فهم النص، لذا فإنّ الغاية من مشكال أن يقدّم تشكيلا أوليا ومن ثمّ يقدّم اقتراحات تُمكّنُ من تعديل التشكيل.',
    'ما هي المقاربة المستخدمة للتشكيل؟',
    ' يستعمل مشكال مقاربة لغوية مبنية على مراحل التحليل الصرفي والنحوي والدلالي للوصول إلى اختيار التشكيل المناسب من بين عدّة حالات ممكنة.'
  ];
}
